
today = "hello world"
a=input("입력 해보세요: ")
print(a)
#print(today)

'''
default 파산, 기본, 관리되지 않은

>>> def apple(a):
...     '입력 값은: '+a



1. 100만원으로 컴퓨터 조립해오기
-> 다나와 사이트 참고!
-> 카테고리
	- cpu (컴퓨터 두뇌)
		OS (운영체제 하드웨어(마우스, 키보드, 모니터, usb), 소프트웨어(프로그램)를 소통하게 해주는 장치)
		OS의 연산(2진수 0,1)을 도와줌.
		i3-6666, i5-888, i7-7888
	- ram (램 메모리)
		8G 4G 프로그램을 한번에 관리할 수 있는 용량
	- ssd / hhd
		저장공간(ssd:빠르고 작다 / HDD: 크다 느리다 용량크다)
		125GB

	-본체, 쿨러, 전원케이블...


2. 조건문과 반복문을 이용해 프로그램(게임 등)을 만들자.
->

3. 파이썬 문자열 다루는 라이브러리 조사
-> 
'''
