#-*- coding:utf-8 -*-
#today = "hello world"
#a=input("입력 해보세요: ")
print("신호등에 걸리셨습니다. 기다리시겠습니까?")
print("1번 기다린다, 2번 기다리지 않는다.")
a=input("입력해보세요: ")
print("몇 초 후에 빨간불로 바뀝니다.")
print("몇 초 후에 초록불로 바뀝니다.")
print("빨간불로 바뀌기 5초전부터 소리 나는 것")
print("5")
print("4")
print("3")
print("2")
print("1")
print("노란불입니다.")
print("신호등에 걸리셨습니다. 기다리시겠습니까?")
print("1번 기다린다, 2번 기다리지 않는다.")
a=input("입력해 보세요:")
print("신호등 게임이 끝났습니다.")
'''
[신호등 게임설명]

C:\\Users\\Administrator\\Desktop>python traffic-light.py
(출력)신호등에 걸리셨습니다. 기다리시겠습니까?
(출력)1번 기다린다, 2번 기다리지 않는다.
(입력)1
(출력)몇 초 후에 빨간불로 바뀝니다.
(출력)몇 초 후에 초록불로 바뀝니다.
(출력)빨간불로 바뀌기 5초전부터 소리 나는 것
(출력)5
(출력)4
(출력)3
(출력)2
(출력)1
(출력)노란불입니다.
(출력)신호등에 걸리셨습니다. 기다리시겠습니까?
(출력)1번 기다린다, 2번 기다리지 않는다.
(입력)2
(출력)신호등 게임이 끝났습니다.
'''